/*
MySQL Backup
Database: bigdata
Backup Time: 2026-07-14 10:08:34
*/

SET FOREIGN_KEY_CHECKS=0;
DROP TABLE IF EXISTS `bigdata`.`ads_talent_exp`;
DROP TABLE IF EXISTS `bigdata`.`ads_talent_salary`;
DROP TABLE IF EXISTS `bigdata`.`ads_talent_salary_struct`;
CREATE TABLE `ads_talent_exp` (
  `exp_req` text,
  `job_count` bigint(20) NOT NULL,
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
CREATE TABLE `ads_talent_salary` (
  `edu_level` text,
  `exp_level` text,
  `avg_salary` double DEFAULT NULL,
  `job_count` bigint(20) NOT NULL,
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
CREATE TABLE `ads_talent_salary_struct` (
  `salary_bucket` text NOT NULL,
  `sort_order` int(11) NOT NULL,
  `job_count` bigint(20) NOT NULL,
  `update_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
BEGIN;
LOCK TABLES `bigdata`.`ads_talent_exp` WRITE;
DELETE FROM `bigdata`.`ads_talent_exp`;
INSERT INTO `bigdata`.`ads_talent_exp` (`exp_req`,`job_count`,`update_time`) VALUES ('1-3年', 32748, '2026-07-12 23:31:49'),('3-5年', 23049, '2026-07-12 23:31:49'),('经验不限', 22673, '2026-07-12 23:31:49'),('5-10年', 9095, '2026-07-12 23:31:49'),('无经验', 4045, '2026-07-12 23:31:49'),('1年以下', 1420, '2026-07-12 23:31:49'),('10年以上', 1125, '2026-07-12 23:31:49')
;
UNLOCK TABLES;
COMMIT;
BEGIN;
LOCK TABLES `bigdata`.`ads_talent_salary` WRITE;
DELETE FROM `bigdata`.`ads_talent_salary`;
INSERT INTO `bigdata`.`ads_talent_salary` (`edu_level`,`exp_level`,`avg_salary`,`job_count`,`update_time`) VALUES ('本科', '3-5年', 12777.85, 15144, '2026-07-13 00:34:49'),('大专', '经验不限', 6998.48, 5034, '2026-07-13 00:34:49'),('学历不限', '1-3年', 9227.54, 1158, '2026-07-13 00:34:49'),('硕士', '无经验', 2442.96, 699, '2026-07-13 00:34:49'),('中专/中技', '3-5年', 7446.43, 56, '2026-07-13 00:34:49'),('EMBA', '经验不限', 4500, 1, '2026-07-13 00:34:49'),('博士', '1-3年', 12499.88, 4, '2026-07-13 00:34:49'),('高中', '10年以上', 17000, 1, '2026-07-13 00:34:49'),('大专', '5-10年', 9613.8, 1697, '2026-07-13 00:34:49'),('高中', '3-5年', 7285.71, 14, '2026-07-13 00:34:49'),('学历不限', '1年以下', 9706.62, 117, '2026-07-13 00:34:49'),('高中', '经验不限', 8075.34, 150, '2026-07-13 00:34:49'),('初中及以下', '1-3年', 7250, 2, '2026-07-13 00:34:49'),('MBA/EMBA', '经验不限', 4000, 1, '2026-07-13 00:34:49'),('初中及以下', '1年以下', 8000, 1, '2026-07-13 00:34:49'),('本科', '无经验', 3249.84, 2629, '2026-07-13 00:34:49'),('学历不限', '经验不限', 9195.97, 2501, '2026-07-13 00:34:49'),('高中', '1年以下', 8537.47, 18, '2026-07-13 00:34:49'),('中专/中技', '无经验', 6892.15, 81, '2026-07-13 00:34:49'),('博士', '经验不限', 35000, 1, '2026-07-13 00:34:49'),('大专', '无经验', 3773.84, 387, '2026-07-13 00:34:49'),('硕士', '1-3年', 12903.44, 1032, '2026-07-13 00:34:49'),('中专/中技', '经验不限', 7657.78, 225, '2026-07-13 00:34:49'),('硕士', '1年以下', 7850, 60, '2026-07-13 00:34:49'),('大专', '1-3年', 6565.31, 12238, '2026-07-13 00:34:49'),('学历不限', '10年以上', 11918.92, 37, '2026-07-13 00:34:49'),('硕士', '10年以上', 51118.64, 59, '2026-07-13 00:34:49'),('EMBA', '3-5年', 11500, 13, '2026-07-13 00:34:49'),('博士', '5-10年', 42500, 6, '2026-07-13 00:34:49'),('高中', '1-3年', 6942.22, 225, '2026-07-13 00:34:49'),('学历不限', '5-10年', 11931.81, 66, '2026-07-13 00:34:49'),('学历不限', '无经验', 7975.11, 231, '2026-07-13 00:34:49'),('初中及以下', '经验不限', 11100, 5, '2026-07-13 00:34:49'),('中专/中技', '5-10年', 5833.33, 3, '2026-07-13 00:34:49'),('大专', '1年以下', 6187.84, 424, '2026-07-13 00:34:49'),('中专/中技', '1年以下', 7000, 2, '2026-07-13 00:34:49'),('高中', '无经验', 8166.67, 18, '2026-07-13 00:34:49'),('硕士', '3-5年', 16671.59, 1049, '2026-07-13 00:34:49'),('硕士', '经验不限', 9194.38, 923, '2026-07-13 00:34:49'),('本科', '1年以下', 7034.77, 798, '2026-07-13 00:34:49'),('大专', '3-5年', 7384, 6343, '2026-07-13 00:34:49'),('硕士', '5-10年', 23131.03, 435, '2026-07-13 00:34:49'),('学历不限', '3-5年', 15929.07, 430, '2026-07-13 00:34:49'),('大专', '10年以上', 13822.76, 134, '2026-07-13 00:34:49'),('本科', '10年以上', 22957.49, 894, '2026-07-13 00:34:49'),('高中', '5-10年', 41700, 5, '2026-07-13 00:34:49'),('本科', '经验不限', 8728.87, 13832, '2026-07-13 00:34:49'),('本科', '5-10年', 16172.68, 6883, '2026-07-13 00:34:49'),('本科', '1-3年', 9841.73, 17928, '2026-07-13 00:34:49'),('中专/中技', '1-3年', 6487.58, 161, '2026-07-13 00:34:49')
;
UNLOCK TABLES;
COMMIT;
BEGIN;
LOCK TABLES `bigdata`.`ads_talent_salary_struct` WRITE;
DELETE FROM `bigdata`.`ads_talent_salary_struct`;
INSERT INTO `bigdata`.`ads_talent_salary_struct` (`salary_bucket`,`sort_order`,`job_count`,`update_time`) VALUES ('8k-12k', 4, 23224, '2026-07-12 23:33:32'),('12k-20k', 5, 16302, '2026-07-12 23:33:32'),('5k-8k', 3, 32660, '2026-07-12 23:33:32'),('20k-30k', 6, 4471, '2026-07-12 23:33:32'),('3k-5k', 2, 11488, '2026-07-12 23:33:32'),('30k以上', 7, 2428, '2026-07-12 23:33:32'),('3k以下', 1, 3582, '2026-07-12 23:33:32')
;
UNLOCK TABLES;
COMMIT;
