/*
MySQL Backup
Source Server Version: 5.7.29
Source Database: job_analysis
Date: 2026/7/14 16:14:23
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
--  Table structure for `skill_word_cloud`
-- ----------------------------
DROP TABLE IF EXISTS `skill_word_cloud`;
CREATE TABLE `skill_word_cloud` (
  `word` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `count` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
--  Table structure for `top_company`
-- ----------------------------
DROP TABLE IF EXISTS `top_company`;
CREATE TABLE `top_company` (
  `company_name` text COLLATE utf8mb4_unicode_ci,
  `job_count` bigint(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
--  Table structure for `welfare_mention_rate`
-- ----------------------------
DROP TABLE IF EXISTS `welfare_mention_rate`;
CREATE TABLE `welfare_mention_rate` (
  `welfare_name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `appear_count` bigint(20) NOT NULL,
  `mention_rate` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- ----------------------------
--  Records 
-- ----------------------------
INSERT INTO `skill_word_cloud` VALUES ('税务','467'), ('合同审核','1927'), ('项目管理','1779'), ('绩效考核','99'), ('法律咨询','10154'), ('招投标','17501'), ('公积金','135'), ('Excel','1169'), ('劳动仲裁','340'), ('成本核算','199'), ('社保','1075'), ('风控','2727'), ('CAD','563'), ('Word','1099'), ('PPT','806'), ('审计','2790'), ('MySQL','1'), ('Oracle','1'), ('金蝶','6'), ('出纳','14'), ('Python','24'), ('SQL','36'), ('员工关系','50'), ('ERP','72'), ('资产评估','89'), ('财务报表','91');
INSERT INTO `top_company` VALUES ('北京市盈科律师事务所','745'), ('广东云云律师事务所','702'), ('北京三快在线科技有限公司','666'), ('尔华法律咨询广东有限公司','586'), ('北京海润天睿律师事务所','439'), ('华彬快速消费品投资管理有限公司','403'), ('河南良承律师事务所','290'), ('河南国银律师事务所','246'), ('中国信息通信研究院','229'), ('北京冠领律师事务所','224'), ('北京市安理律师事务所','209'), ('广东普罗米修律师事务所','205'), ('外企德科数字技术有限公司','205'), ('公诚管理咨询有限公司北京分公司','184'), ('河北平太律师事务所','182'), ('惠州市浩创科技发展有限公司','172'), ('科顺防水科技股份有限公司','171'), ('江苏聚赢法务咨询服务有限公司','165'), ('浙江千麦司法鉴定中心','157'), ('湖北省成套招标股份有限公司','156'), ('广东华商律师事务所','154'), ('北京中昱瑞通科技有限公司','151'), ('北京大成律师事务所','151'), ('江苏中卉云信息科技有限公司','150'), ('陕西东康律师事务所','148'), ('吉林鸣正司法鉴定中心','147'), ('北京必华咨理国际商务服务有限公司','145'), ('武汉楚信企业管理有限公司','142'), ('上海申沪律师事务所','141'), ('上海市弘正律师事务所','141'), ('北京盈科上海律师事务所','138'), ('广东商达律师事务所','137'), ('贝壳找房科技有限公司','126'), ('北京市万慧达律师事务所','123'), ('上海市通力律师事务所','120'), ('北京市道可特律师事务所','115'), ('山东岛城律师事务所','115'), ('陕西言恩律师事务所','114'), ('深圳旷真法务集团有限公司','113'), ('北京市尚公律师事务所','112'), ('北京聚赋律师事务所','110'), ('青岛联信商务咨询有限公司','109'), ('河南光法南阳律师事务所','109'), ('河南领一律师事务所','107'), ('北京高文律师事务所','103'), ('上海邦芒人力资源有限公司','102'), ('河南壹众律师事务所','101'), ('修正药业集团营销有限公司通药分公司','99'), ('万洋建设集团有限公司','99'), ('成都市味之绝餐饮管理有限公司','98');
INSERT INTO `welfare_mention_rate` VALUES ('团建旅游','107','0.11'), ('补充医疗','102','0.11'), ('年终分红','231','0.24'), ('下午茶','413','0.43'), ('六险一金','161','0.17'), ('双休','5558','5.82'), ('五险一金','3872','4.06'), ('弹性工作','370','0.39'), ('定期体检','732','0.77'), ('带薪年假','1822','1.91'), ('绩效奖金','1958','2.05'), ('生日福利','197','0.21'), ('年终奖','569','0.6'), ('项目奖金','187','0.2'), ('高温补贴','136','0.14'), ('餐补','1263','1.32'), ('节日福利','2647','2.77'), ('股票期权','6','0.01'), ('婚假产假','10','0.01'), ('加班补贴','7','0.01'), ('育儿假','15','0.02'), ('包吃住','17','0.02'), ('住房补贴','49','0.05'), ('通讯补贴','44','0.05'), ('员工宿舍','52','0.05'), ('节日礼品','61','0.06'), ('健身房','64','0.07'), ('交通补贴','77','0.08');
